{
    "projets": [
        {
            "id": 1,
            "title": "Intégration maquette HTML/CSS",
            "description": "Dans le cadre du projet Booki, j'ai été chargé de l'intégration de l'interface utilisateur en utilisant HTML et CSS. Booki est un site web permettant aux utilisateurs de trouver facilement des hébergements et des activités dans la ville de leur choix. En travaillant sur l'interface, mon objectif était de créer une expérience utilisateur fluide et intuitive. <br> <br> J'ai développé des fonctionnalités de recherche et de filtrage pour permettre aux utilisateurs de trouver rapidement ce qu'ils cherchent. L'accent a été mis sur la présentation visuelle attrayante des résultats de recherche, mettant en valeur les informations pertinentes de manière claire et concise. Le design a été conçu pour être à la fois moderne et convivial, afin de garantir une expérience agréable aux utilisateurs lors de leur navigation sur le site Booki. <br><br>J'ai rencontré des difficultés concernant le responsive et le CSS, étant donné le nombre de différents d'hébergements  et de la grille qui les contient. J'ai appris à gérer le CSS et le responsive grace à ce projet, en me renseignant et en suivant les concepts UI/UX.",
            "img": "../assets/Capture_ecran_booki.png",
            "link": "https://dmc1dev.github.io/OC_P2_DMC-DEV_Booki/"
        },
        {
            "id": 2,
            "title": "Création portfolio JavaScript",
            "description": "Dans le cadre de ce projet, j'ai créé un portfolio personnalisé pour l'architecte Sophie Bluel. Le portfolio comprend une fonction de connexion sécurisée permettant à Sophie de gérer ses projets. J'ai utilisé JavaScript pour rendre le portfolio interactif, en permettant l'ajout dynamique de nouveaux projets via le DOM. Cela offre à Sophie une plateforme professionnelle pour présenter son travail tout en facilitant la mise à jour régulière de son portfolio.<br><br>J'ai rencontrés quelques difficultés liées à la création de la modale et des bugs relatifs au backend mais j'ai réussi a les surmonter en communiquant avec l'équipe. ",
            "img": "../assets/Capture_ecran_portfolio.png",
            "link": "https://dmc1dev.github.io/OC_P3_DMC-Dev_Portfolio_Sophie_Bluel/"
        }
    ]
}